In [18]:
import pandas as pd
from collections import namedtuple

In [19]:
job_title_to_datasrc = namedtuple('job_title_to_data', ['job_title', 'data_source'])
comp_data = namedtuple('comp_data', ['state', 'annual_salary', 'monthly_pay', 'weekly_pay', 'hourly_wage'])

In [20]:
datasets = [
    job_title_to_datasrc('Data Analyst', 'data-analyst.csv'),
    job_title_to_datasrc('Data Engineer', 'data-engineer.csv'),
    job_title_to_datasrc('Data Scientist', 'data-scientist.csv'),
    job_title_to_datasrc('Machine Learning Engineer', 'machine-learning-engineer.csv'),
    job_title_to_datasrc('Business Analyst', 'business-analyst.csv')
]
datasets

[job_title_to_data(job_title='Data Analyst', data_source='data-analyst.csv'),
 job_title_to_data(job_title='Data Engineer', data_source='data-engineer.csv'),
 job_title_to_data(job_title='Data Scientist', data_source='data-scientist.csv'),
 job_title_to_data(job_title='Machine Learning Engineer', data_source='machine-learning-engineer.csv'),
 job_title_to_data(job_title='Business Analyst', data_source='business-analyst.csv')]

In [21]:
data_frames = []

In [22]:
for ds in datasets:
    df = pd.read_csv(ds.data_source, delimiter='\t')
    df['Job Title'] = ds.job_title
    data_frames.append(df)

In [23]:
dfs = pd.concat(data_frames)
dfs.head()

        State Annual Salary Monthly Pay Weeky Pay Houly Wage     Job Title
0    New York       $98,238      $8,186    $1,889     $47.23  Data Analyst
1  New Jersey       $84,878      $7,073    $1,632     $40.81  Data Analyst
2   Wisconsin       $84,340      $7,028    $1,621     $40.55  Data Analyst
3      Nevada       $83,624      $6,968    $1,608     $40.20  Data Analyst
4     Wyoming       $83,611      $6,967    $1,607     $40.20  Data Analyst

In [24]:
dfs = dfs.replace(regex=r'^\$(.+)$', value='\\1')
dfs = dfs.replace(regex=r',(.+)', value='\\1')
dfs.head()

        State Annual Salary Monthly Pay Weeky Pay Houly Wage     Job Title
0    New York         98238        8186      1889      47.23  Data Analyst
1  New Jersey         84878        7073      1632      40.81  Data Analyst
2   Wisconsin         84340        7028      1621      40.55  Data Analyst
3      Nevada         83624        6968      1608      40.20  Data Analyst
4     Wyoming         83611        6967      1607      40.20  Data Analyst

In [25]:
dfs.to_csv('salary.csv', index=False)